--когда надо, чтобы начало периода означало конец предыдущего периода. А последний период заканчивается, когда начинается самый первый.

with dataFromFile(period_id, time_start, state_id) as (
	select * from (values
	('08f3924c-56f0-0242ac130002','06:50:00',2),
	('08f3924c-56f0-0242ac130002','07:00:00',3),
	('08f3924c-56f0-0242ac130002','16:00:00',1),
	('08f3924c-56f0-0242ac130002','01:00:00',7),
	('08f3924c-56f0-0242ac130002','03:50:00',1),

	('1090b112-f602-0242ac120002','00:00:00',1),

	('1f479246-393b-0242ac120002','11:30:00',3),
	('1f479246-393b-0242ac120002','20:00:00',1),
	('1f479246-393b-0242ac120002','01:00:00',7),
	('1f479246-393b-0242ac120002','03:50:00',1),

	('21cf7132-b939-0242ac120002','00:00:00',1),

	('29b4059e-90c9-bd81f0b1ad00','05:00:00',3),
	('29b4059e-90c9-bd81f0b1ad00','15:00:00',1),
	('29b4059e-90c9-bd81f0b1ad00','01:00:00',7),
	('29b4059e-90c9-bd81f0b1ad00','03:50:00',1),

	('29fb52e8-3947-0242ac120002','06:50:00',2),
	('29fb52e8-3947-0242ac120002','07:00:00',3),
	('29fb52e8-3947-0242ac120002','15:40:00',5),
	('29fb52e8-3947-0242ac120002','15:50:00',1),
	('29fb52e8-3947-0242ac120002','16:00:00',2),
	('29fb52e8-3947-0242ac120002','16:05:00',6),
	('29fb52e8-3947-0242ac120002','20:50:00',1),
	('29fb52e8-3947-0242ac120002','01:00:00',7),
	('29fb52e8-3947-0242ac120002','03:50:00',1)		   
	) dataFromFile 
)
--основной запрос
select schedule_id, time_start
	,coalesce( 
		lead(time_start) over(partition by schedule_id order by time_start), 
		min(time_start) over(partition by schedule_id order by time_start)
	) time_end
	,state_id
from dataFromFile

